{
    "comments": [
        {
            "postedBy": "jonknee",
            "postedAgo": "0 minutes ago",
            "comment": "<font >If you get ripped off on an online drug market you don&#x27;t have a recourse (a poor feedback, but hey then you&#x27;ll get a poor feedback back).<p>Similarly, I like that I can call my credit card company and dispute a charge. The blockchain style of trust just means you get screwed.</font>",
            "id": 8370544,
            "points": 0,
            "parentId": 8370938,
            "postId": 8370544,
            "children": []
        },
        {
            "postedBy": "nikils",
            "postedAgo": "0 minutes ago",
            "comment": "<font >Why not create a different rendering engine and replace HTML,CSS, JS ?</font>",
            "id": 8368199,
            "points": 0,
            "parentId": 8368459,
            "postId": 8368199,
            "children": []
        },
        {
            "postedBy": "jdreaver",
            "postedAgo": "1 minute ago",
            "comment": "<font >Surge pricing is <i>necessary</i> for more important goods, or else there will be a shortage!<p>When there is a hurricane, and the government declares a ban on &quot;price gouging,&quot; then there is inevitably a shortage on things like gasoline, water, food, etc, because people by more than they need. When these goods cost more, people will tend to by only as much as they need. A sudden increase in demand should be met with a corresponding increase in price, but that is not allowed to happen. Furthermore, if the price of water, gas, and food goes up, then it is profitable for people to drive hundreds of miles in trucks with those goods to sell them, thus increasing the supply.<p>In the case of Uber and Lyft, surge pricing sorts out who really wants the rides. You might rethink going to the mall or the bar during surge pricing because you are competing with people who need those rides much more. If surge pricing was banned, then a traveler might not be able to get home from the airport because someone wanted an Uber ride to a sports bar to watch a football game.</font>",
            "id": 8370544,
            "points": 0,
            "parentId": 8370960,
            "postId": 8370544,
            "children": []
        },
        {
            "postedBy": "nnethercote",
            "postedAgo": "2 minutes ago",
            "comment": "<font >Sunspider is an ancient, awful benchmark suite that has been optimized to the point of insanity. For example, every major browser has a daylight savings offset cache that is no use to any real code but speeds up Sunspider significantly. It needs to die. You should ignore it.<p>Octane is better, though still flawed: <a href=\"https://blog.mozilla.org/nnethercote/2012/08/24/octane-minus-v8/\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.mozilla.org&#x2F;nnethercote&#x2F;2012&#x2F;08&#x2F;24&#x2F;octane-minus...</a>.<p>The state of browser benchmarking isn&#x27;t good. Here are my ideas on how to fix it: <a href=\"https://blog.mozilla.org/nnethercote/2014/06/16/a-browser-benchmarking-manifesto/\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.mozilla.org&#x2F;nnethercote&#x2F;2014&#x2F;06&#x2F;16&#x2F;a-browser-be...</a>. The political&#x2F;organizational challenges are as big or bigger than the technical challenges.<p>And really, you should care most about how each browser performs on the workloads you are interested in.</font>",
            "id": 8368371,
            "points": 0,
            "parentId": 8369855,
            "postId": 8368371,
            "children": []
        },
        {
            "postedBy": "enneff",
            "postedAgo": "2 minutes ago",
            "comment": "<font >&gt; What is going on there, Aussies?<p>From decades of comfortable living, Australia has one of the most politically apathetic populations of any country. Nobody cares. Or, rather, only a very small minority actually cares to think about this stuff.</font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370876,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "jonknee",
            "postedAgo": "2 minutes ago",
            "comment": "<font >Yea and it wasn&#x27;t really failed. Uber says they weed out people with dangerous driving records and the DA didn&#x27;t mention the driver had one. The cited &quot;Felony drug dealing&quot; sounds really scary, but it was for selling weed five years ago. After this specific case Uber volunteered to make its background checks more rigorous.<p><a href=\"http://www.sfgate.com/default/article/Uber-driver-charged-with-punching-S-F-passenger-5526413.php\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sfgate.com&#x2F;default&#x2F;article&#x2F;Uber-driver-charged-wi...</a><p>Seems like a DA being a DA and it will go away once his power tantrum runs its course.</font>",
            "id": 8370544,
            "points": 0,
            "parentId": 8370749,
            "postId": 8370544,
            "children": []
        },
        {
            "postedBy": "Quizz",
            "postedAgo": "5 minutes ago",
            "comment": "<font >But is $40k on offer in these more affordable parts?</font>",
            "id": 8370321,
            "points": 0,
            "parentId": 8370919,
            "postId": 8370321,
            "children": []
        },
        {
            "postedBy": "esrauch",
            "postedAgo": "6 minutes ago",
            "comment": "<font >I don&#x27;t know that Google has too much blue sky research itself. I guess maybe something that Kurzweil is up to, have they released anything about him?<p>I guess probably anything that Hinton was hired for which is more fundamental neural network research, maybe the cat recognizing neural network research they did on youtube video?</font>",
            "id": 8356756,
            "points": 0,
            "parentId": 8364671,
            "postId": 8356756,
            "children": []
        },
        {
            "postedBy": "shkkmo",
            "postedAgo": "8 minutes ago",
            "comment": "<font >Google didn&#x27;t acquire Niantic. Niantic was launched as a &#x27;startup&#x27; within google.<p><a href=\"http://www.fastcompany.com/3004551/can-startup-live-inside-google-niantic-labs-creators-field-trip-and-ingress-try\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fastcompany.com&#x2F;3004551&#x2F;can-startup-live-inside-g...</a></font>",
            "id": 8370119,
            "points": 0,
            "parentId": 8370941,
            "postId": 8370119,
            "children": []
        },
        {
            "postedBy": "graywh",
            "postedAgo": "9 minutes ago",
            "comment": "<font >Syntax based folding can slow it down a lot, especially with Ruby code.</font>",
            "id": 8367384,
            "points": 0,
            "parentId": 8370761,
            "postId": 8367384,
            "children": []
        },
        {
            "postedBy": "nlavezzo",
            "postedAgo": "9 minutes ago",
            "comment": "<font >At FoundationDB we recently did a blog about using FDB for time series data:<p><a href=\"http://blog.foundationdb.com/designing-a-schema-for-time-series-data-using-fdb\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.foundationdb.com&#x2F;designing-a-schema-for-time-ser...</a><p>One of our largest customer installations is for this purpose.</font>",
            "id": 8368509,
            "points": 0,
            "parentId": 8368509,
            "postId": 8368509,
            "children": []
        },
        {
            "postedBy": "UrMomReadsHN",
            "postedAgo": "9 minutes ago",
            "comment": "<font >Ah yea, good old Survivorship bias.<p><a href=\"http://en.wikipedia.org/wiki/Survivorship_bias\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Survivorship_bias</a></font>",
            "id": 8369136,
            "points": 0,
            "parentId": 8370209,
            "postId": 8369136,
            "children": []
        },
        {
            "postedBy": "daemin",
            "postedAgo": "9 minutes ago",
            "comment": "<font >Of particular note with this issue is that <i>both</i> major parties (The Liberals in Government, and Labor in Opposition) voted <i>for</i> this legislation.<p>It appears to me that regardless of who of the major parties was actually in power something like this would have come in.</font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370352,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "Ygg2",
            "postedAgo": "9 minutes ago",
            "comment": "<font >Implying that there is such a thing as just enough power.</font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370992,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "SeoxyS",
            "postedAgo": "10 minutes ago",
            "comment": "<font >In Vim, a single badly-written plugin can make the entire editor feel sluggish. I&#x27;d recommend disabling your plugins one-by-one, until you find the culprit.</font>",
            "id": 8367384,
            "points": 0,
            "parentId": 8370553,
            "postId": 8367384,
            "children": []
        },
        {
            "postedBy": "richcsmith",
            "postedAgo": "11 minutes ago",
            "comment": "<font >Beyond the scope. The DA didn&#x27;t say he wanted them to offer more thorough background checks or threaten to shut them down if they didn&#x27;t. Likewise, afaik, he&#x27;s also not going after taxi companies saying drivers aren&#x27;t allowed to drive if they have records, because it&#x27;s not illegal.<p>That said, I think it&#x27;s completely reasonable for the city to ask these companies to stop lying to consumers to make us feel safer for the sake of their revenue.<p>I&#x27;m totally for innovation and everything that comes with it though. I want these companies to succeed (well, maybe not Uber) but them behaving in this way is going to make it more difficult from a legal perspective for the startups of tomorrow.<p>Anyway, does anyone know if there&#x27;s any type of &#x27;Startup Legal Counsel&#x27; where companies that are innovating faster than the the law is able to evolve can be advised on the laws they may be breaking or help them lobby to get relevant laws updated faster before it has to get to this point? Or should they just know better?</font>",
            "id": 8370544,
            "points": 0,
            "parentId": 8370749,
            "postId": 8370544,
            "children": []
        },
        {
            "postedBy": "broodbucket",
            "postedAgo": "12 minutes ago",
            "comment": "<font >The public believes there has been a recent terror attack because the news have been reporting stories of the &quot;home-grown terror threat&quot; of local ISIS supporters planning to execute members of the public.<p>Over 800 police were involved on raids that ended up detaining 30, and only one individual has been arrested on any terrorism-related charge.  The national security threat level was raised, and the general public seems to believe that there is something to fear.<p>I&#x27;m going a bit conspiratard here, but it looks an awful lot like the government just invented a terror threat to gain new powers...</font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370876,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "pavel_lishin",
            "postedAgo": "12 minutes ago",
            "comment": "<font >&gt; <i>some company (Jamba Juice?) had all its stores show up in-game as portals.</i><p>Duane Reade as well.</font>",
            "id": 8370119,
            "points": 0,
            "parentId": 8370941,
            "postId": 8370119,
            "children": []
        },
        {
            "postedBy": "shkkmo",
            "postedAgo": "12 minutes ago",
            "comment": "<font >Who said it is a right? Getting payday loans or owning a credit card are not rights, yet we regulated the lending industry in those cases.</font>",
            "id": 8365129,
            "points": 0,
            "parentId": 8365479,
            "postId": 8365129,
            "children": []
        },
        {
            "postedBy": "zobzu",
            "postedAgo": "12 minutes ago",
            "comment": "<font >well, installing a LKM, just that =p<p>Now sysdig aint bad per se but id like to see it mainlined or using mainline code</font>",
            "id": 8370660,
            "points": 0,
            "parentId": 8370660,
            "postId": 8370660,
            "children": []
        },
        {
            "postedBy": "tannerbrockwell",
            "postedAgo": "13 minutes ago",
            "comment": "<font >I have created a public domain logo with svg and png rendering for the shellshock bash bug.<p><a href=\"http://www.tannerbrockwell.com/shellshock/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tannerbrockwell.com&#x2F;shellshock&#x2F;</a><p>for the image and link to zip of files with license.</font>",
            "id": 8367958,
            "points": 0,
            "parentId": 8367958,
            "postId": 8367958,
            "children": []
        },
        {
            "postedBy": "leichtgewicht",
            "postedAgo": "14 minutes ago",
            "comment": "<font >Love the simplicity. Some thoughts:<p>- It would be cool to have a button for making a private link for editing (by default its &quot;editable&quot; after clicking a button you enter editmode that is hosted at a different url than the viewmode)<p>- When I leave the browser to lookup the next entry in a list and return the cursor is gone. I have to click in the last entry to get my cursor back.</font>",
            "id": 8366557,
            "points": 0,
            "parentId": 8366557,
            "postId": 8366557,
            "children": []
        },
        {
            "postedBy": "vacri",
            "postedAgo": "14 minutes ago",
            "comment": "<font >The thing is that they have been doing just fine with their current powers - there is no need to expand them. I have no doubt that actual terrorist plotting has been countered by ASIO, but I also have no doubt that ASIO clearly already have enough powers to do their job appropriately.</font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370764,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "jjsalamon",
            "postedAgo": "14 minutes ago",
            "comment": "<font ><i>&gt; The average person doesn&#x27;t care about government snooping.</i><p>New Zealand recently re-elected their head office just days after their internal government spying came to light. The majority of voters don&#x27;t care. To quote another reddit thread:<p><i>&gt; The big reveal was actually that New Zealand was conducting mass surveillance of its population when it&#x27;s PM and gov&#x27;t promised it wasn&#x27;t.[1]</i><p>Last year New Zealand was voted &#x27;freest country.&#x27;[2]<p>[1] <a href=\"http://www.reddit.com/r/worldnews/comments/2gf9p3/the_kim_dotcom_big_reveal_is_out_an_email_which/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;worldnews&#x2F;comments&#x2F;2gf9p3&#x2F;the_kim_do...</a><p>[2]\n<a href=\"http://www.fraserinstitute.org/research-news/news/display.aspx?id=19171\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fraserinstitute.org&#x2F;research-news&#x2F;news&#x2F;display.as...</a></font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370897,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "randomdata",
            "postedAgo": "14 minutes ago",
            "comment": "<font >When half of all working Americans make less than $30,000 per year[1], I&#x27;m sure $40,000 looks pretty amazing. I wouldn&#x27;t want to go anywhere near SF on that kind of income, but is a lot to work with where costs of living are far more reasonable.<p>[1] <a href=\"http://en.wikipedia.org/wiki/Personal_income_in_the_United_States\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Personal_income_in_the_United_S...</a></font>",
            "id": 8370321,
            "points": 0,
            "parentId": 8370780,
            "postId": 8370321,
            "children": []
        },
        {
            "postedBy": "shkkmo",
            "postedAgo": "15 minutes ago",
            "comment": "<font >&gt; The crux of your argument is that &quot;consumers often have no choice but to take whatever deal&quot; and that lack of choice makes this issue important enough for the government to step in. Is that right?<p>No, that&#x27;s completely wrong. &quot;Lack of choice&quot; is not the only or main argument for consumer protection. We don&#x27;t regulate the arsenic content of toys because parents have no choice but to buy commercially made toys.<p>The argument is &quot;consumers are being treated by some bad actors in a manner by that interferes with their safety, privacy and dignity&quot;. The solution is to look at what the good actors are doing, and mandate that behavior to protect consumers.<p>&gt; First I would propose spending government time to address those core issues before burning time on this symptom.<p>Why? Those core issues are incredibly controversial. We shouldn&#x27;t avoid regulating a new means of loan efforcement because we can&#x27;t solve fundamental social issues.<p>&gt; Second, all these rules will make the car more expensive; it&#x27;s a slight tax on the responsible paid by those who might miss payments.<p>What are you talking about? This technology (as discussed in the article) only applies to people who&#x27;s are being offered subprime car loans and are a high risk on not paying. Additionaly, the technology in question should REDUCE the loan costs of subprime auto loans.<p>&gt; Third, this case is rare and it&#x27;s unclear its worth the cost and unexpected consequence of regulation.<p>What are you talking about? The article doesn&#x27;t give clear numbers for the US market for this technology, but it doesn&#x27;t seem to be particularly small.\n&quot;Corinne Kirkendall, vice president for compliance and public relations for PassTime, which has sold 1.5 million devices worldwide,&quot;\n&quot;Roughly 25 percent of all new auto loans made last year were subprime, and the volume of subprime auto loans reached more than $145 billion in the first three months of this year.&quot;</font>",
            "id": 8365129,
            "points": 0,
            "parentId": 8365559,
            "postId": 8365129,
            "children": []
        },
        {
            "postedBy": "vacri",
            "postedAgo": "15 minutes ago",
            "comment": "<font >Australia has limited movement in the copyright area anyway, due to free trade treaty requirements with the US.</font>",
            "id": 8370352,
            "points": 0,
            "parentId": 8370975,
            "postId": 8370352,
            "children": []
        },
        {
            "postedBy": "marcosdumay",
            "postedAgo": "15 minutes ago",
            "comment": "<font >What about early?</font>",
            "id": 8370418,
            "points": 0,
            "parentId": 8370840,
            "postId": 8370418,
            "children": []
        },
        {
            "postedBy": "ZanyProgrammer",
            "postedAgo": "16 minutes ago",
            "comment": "<font >Yeah, I agree, its just that Webb wasn&#x27;t any normal suicide-his exposes on the CIA and their ilk just add a ton of fuel to the fire that you wouldn&#x27;t have with a run of the mill suicide.</font>",
            "id": 8370418,
            "points": 0,
            "parentId": 8370932,
            "postId": 8370418,
            "children": []
        },
        {
            "postedBy": "didip",
            "postedAgo": "16 minutes ago",
            "comment": "<font >The big idea in storing time series data is to partition data by timestamp (daily&#x2F;hourly&#x2F;minutely depending on how granular do you want it). This technique can be done in various data store:<p>* I&#x27;ve done it in PostgreSQL using triggers and table inheritance. With this technique trimming old data is as simple as dropping old tables.<p>* Logstash folks use daily indices on ElasticSearch to store log data which is time series by nature.<p>* I have heard from quite a few people that Cassandra works really well with this data model too.</font>",
            "id": 8368509,
            "points": 0,
            "parentId": 8368509,
            "postId": 8368509,
            "children": []
        }
    ],
    "cachedOnUTC": "/Date(1411698561749)/"
}